// بيانات كل أسبوع
const weeksData = [
  {
    title: "الأسبوع الأول",
    hijri: "2 رمضان 1446هـ - 8 رمضان 1446هـ",
    gregorian: "2 مارس - 8 مارس 2025",
    lessons: {
      "الأحد": "التمهيد للدراسة",
      "الإثنين": "الاختبار التشخيصي",
      "الثلاثاء": "حركة الكواكب والجاذبية - قوانين كبلر",
      "الأربعاء": "حل المسائل التدريبية",
      "الخميس": "قانون الجذب الكوني",
      "الجمعة": "إجازة أسبوعية",
      "السبت": "إجازة أسبوعية"
    }
  },
  {
    title: "الأسبوع الثاني",
    hijri: "9 رمضان 1446هـ - 15 رمضان 1446هـ",
    gregorian: "9 مارس - 15 مارس 2025",
    lessons: {
      "الأحد": "الجذب الكوني وقانون كبلر الثالث",
      "الإثنين": "استخدام قانون الجذب الكوني",
      "الثلاثاء": "مدارات الكواكب والأقمار الاصطناعية",
      "الأربعاء": "تسارع الجاذبية الأرضية",
      "الخميس": "نوعا الكتلة ونظرية اينشتاين",
      "الجمعة": "إجازة أسبوعية",
      "السبت": "إجازة أسبوعية"
    }
  },
  {
    title: "الأسبوع الثالث",
    hijri: "16 رمضان 1446هـ - 22 رمضان 1446هـ",
    gregorian: "16 مارس - 22 مارس 2025",
    lessons: {
      "الأحد": "الدرس السادس: وصف الحركة الدورانية - الإزاحة الزاوية",
      "الإثنين": "السرعة الزاوية والتسارع الزاوي",
      "الثلاثاء": "ديناميكا الحركة الدورانية - العزم",
      "الأربعاء": "محصلة العزوم",
      "الخميس": "إجازة عيد الفطر",
      "الجمعة": "إجازة عيد الفطر",
      "السبت": "إجازة عيد الفطر"
    }
  },
  {
    title: "الأسبوع الرابع",
    hijri: "23 رمضان 1446هـ - 29 رمضان 1446هـ",
    gregorian: "23 مارس - 29 مارس 2025",
    lessons: {
      "الأحد": "إجازة عيد الفطر",
      "الإثنين": "إجازة عيد الفطر",
      "الثلاثاء": "إجازة عيد الفطر",
      "الأربعاء": "إجازة عيد الفطر",
      "الخميس": "إجازة عيد الفطر",
      "الجمعة": "إجازة عيد الفطر",
      "السبت": "إجازة عيد الفطر"
    }
  },
  {
      title: "الأسبوع الخامس",
    hijri: "1 شوال 1446هـ - 7 شوال 1446هـ",
    gregorian: "30 مارس - 5 أبريل 2025",
    lessons: {
      "الأحد": "إجازة عيد الفطر",
      "الإثنين": "إجازة عيد الفطر",
      "الثلاثاء": "إجازة عيد الفطر",
      "الأربعاء": "إجازة عيد الفطر",
      "الخميس": "إجازة عيد الفطر",
      "الجمعة": "إجازة عيد الفطر",
      "السبت": "إجازة عيد الفطر"
     }
  }
  
  // يمكن إضافة المزيد من الأسابيع هنا...
];
